---
type: Vertex
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 2
tags: [revit-api, class]
---

# Vertex

`Autodesk.Revit.DB.DirectContext3D.Vertex` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |